//**********************************//
//		ファイル名：ex0710.c          //
//		課題番号  ：7-1              //
//		作成者    ：大友//
//		番号      :	8			    //
//		日付      :2020-09-16       //
//*********************************//
#include <stdio.h>
struct mumdat{
	int num;
	char name[11];
	int syzk;
	int enter;
	int born;
};
int main(void)
{
	struct mumdat syn;
	int endc;

	endc = scanf("%d""%s""%d""%d""%d",&syn.num,syn.name,&syn.syzk,&syn.enter,&syn.born);		while(endc!=EOF){
		printf("0%d %s %d %d %d\n",syn.num,syn.name,syn.syzk,syn.enter,syn.born);
		endc = scanf("%d""%s""%d""%d""%d",&syn.num,syn.name,&syn.syzk,&syn.enter,&syn.born);
	}
	
	return 0;
}

/* 実行結果
010019 内村和義 1010 19800401 19570103
010201 高橋健一 1010 19930401 19650505
010305 石川陽子 1011 19940401 19670302
010302 村田重雄 1021 19940401 19720909
010440 川上みのる 1031 19950401 19751201
010405 新藤恵美子 1011 19950401 19740810
010306 木村卓也 1021 19941001 19751111
010307 野中幸一 1031 19941001 19650607
010209 森山英子 1011 19930401 19650712
010210 高木康二 1051 19930401 19750321
010112 塚本恵子 1061 19900401 19651205
010101 北村一郎 1071 19890401 19650503
010103 中川三郎 1051 19900401 19660505
010115 清水希美江 1011 19910401 19650505
*/